import 'package:test1/test_screens/test_questions.dart';

const questions = [
  TestQuestion('قلة الاهتمام أو الاستمتاع بالأشياء', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('أشعر بالحزن والضيق وعدم السعادة', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('أجد صعوبة في النوم أو البقاء نائماً أو النوم لفترات طويلة', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('أشعر بالخمول و الكسل', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('فقدت شهيتي للطعام أو أكل بشراهة', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('أشعر بالسوء تجاه نفسي أو أني خذلت عائلتي', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion('أشعر بصعوبة في التركيز', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),

  TestQuestion(
    'بدأت بالتحدث أو الحركة ببطء شديد بشكل ملحوظ أو العكس بدأت أشعر بالتوتر وعدم القدرة على الاستقرار',
    ['أبدًا', 'أيام قليلة', 'نصف الأيام', 'تقريبًا كل يوم'],
  ),

  TestQuestion('أشعر أن الحياة لا تستحق العيش', [
    'أبدًا',
    'أيام قليلة',
    'نصف الأيام',
    'تقريبًا كل يوم',
  ]),
];
